{
  "jonathan-hachmeister": {
    "bio": "Jonathan is the founder and Managing Partner of Stage Management, LLC. Jonathan formed Stage Management after over a decade of work in commercial real estate development, finance and management, primarily concentrating on senior housing. Jonathan is a leader by example and is involved in all aspects of his businesses and development projects. His experience with HUD/FHA financing programs, commercial real estate development, construction, property management, and senior living management has afforded him a unique skill set for his future opportunities.",
    "email": "jonathan@stagesenior.com",
    "phone": "303-378-2377"
  },
  "troy-mcclymonds": {
    "bio": "Troy has been a member of Stage Management, LLC since 2016, where he serves as a Managing Partner. He brings a wealth of entrepreneurial experience from the e-commerce and re-manufacturing sectors. As the founder and operator of a successful cell phone refurbishment company for over a decade, he developed exceptional skills in online advertising, automation, customer service, and process optimization—all critical elements in building a thriving enterprise. Often described as a \"human Swiss Army knife,\" Troy demonstrates remarkable versatility across technical and interpersonal domains. His problem-solving abilities range from database troubleshooting to effective employee conflict resolution. Troy has seamlessly transferred these valuable skills to senior living management, where he excels in his current role. With comprehensive expertise in Yardi Systems, talent acquisition, and executive directorship, he leverages his diverse background to transform challenges into opportunities on a daily basis. Troy is also a proud member of the American Seniors Housing Association.",
    "email": "troy@stagesenior.com",
    "phone": "303-667-6217"
  },
  "jeff-ippen": {
    "bio": "As a member of Stage Management LLC since 2018, Jeff has played an integral role in overseeing and enhancing the company's clinical operations. His leadership has focused on streamlining processes, implementing evidence-based protocols, and ensuring the highest standards of patient care across all clinical services. By fostering collaborative relationships with healthcare providers and administrative staff, he has successfully guided clinical teams through periods of significant growth while maintaining exceptional quality metrics. Jeff's tenure at Stage Management LLC has been characterized by a commitment to operational excellence and continuous improvement, complemented by the industry insights gained through his service as a board member on the Colorado Assisted Living Advisory Committee. Leveraging his expertise in clinical oversight, he has spearheaded initiatives that have optimized resource allocation, reduced procedural inefficiencies, and elevated resident quality of life. His strategic vision and hands-on approach to clinical management have contributed significantly to Stage Management LLC's reputation as a trusted partner in the healthcare industry, positioning the organization for sustainable success in an increasingly complex healthcare landscape.",
    "email": "jeff@stagesenior.com",
    "phone": "970-420-8034"
  },
  "ben-chandler": {
    "bio": "Ben Chandler is the Regional Director for Sage Management, LLC, overseeing operations at four assisted living communities across Colorado: Golden Pond Retirement Community, The Gardens on Quail, The Gardens at Columbine, and Stonebridge Retirement Community. A seasoned leader in senior living, Ben is known for his commitment to resident-centered care, strong team development, and strategic growth. A seventh-generation Colorado native, Ben brings a local perspective and a deep sense of community to his work. He believes that empowered employees lead to thriving communities and prioritizes transparency, accountability, and authentic connection in his leadership. Outside of work, Ben enjoys life with his wife, Savannah, their son, Colton, and their two dogs, Dante and Cooper. Colton is a childhood cancer survivor, and his resilience continues to inspire Ben's perspective on life and leadership. The Chandlers love spending time outdoors and never miss a chance to cheer on the Broncos (even when it's painful) and celebrate the Nuggets like true Colorado fans.",
    "email": "ben@stagesenior.com",
    "phone": "303-521-2857"
  },
  "colleen-emery": {
    "bio": "Colleen came to Stage in 2021 after 12 years with The Gardens at Columbine, when Stage took over the management of that assisted living community. She has a diverse background in bookkeeping, information technology, property management, and many aspects of office administration and retail real estate. Colleen's attention to detail, versatility, resourcefulness, and sense of personal responsibility contribute to her strong work ethic. She enjoys the variety of job duties involved in her position with Stage, and the various personalities at all the communities and companies she works with.",
    "email": "colleen@stagesenior.com",
    "phone": ""
  },
  "natasha-barba": {
    "bio": "Natasha Barba serves as our Benefits Administrator, embodying Stage Management's vision of creating resident-focused communities. Natasha expertly manages employee benefits to ensure the well-being of the staff who dedicate their lives to caring for our residents. Her efforts play a vital role in retaining staff independence and fostering a comfortable, inviting work environment.",
    "email": "natasha@stagesenior.com",
    "phone": ""
  },
  "josh-kavinsky": {
    "bio": "Josh Kavinsky serves as the Regional Maintenance Director at STAGE, where he leverages his extensive expertise to oversee maintenance operations across our multiple facilities. With a keen eye for detail and a commitment to excellence, Josh ensures that all our facilities run smoothly.",
    "email": "JKavinsky@stagesenior.com",
    "phone": ""
  },
  "trevor-harwood": {
    "bio": "Trevor is an experienced digital marketer with a passion for driving growth and success. He has a track record of delivering successful campaigns across industries and KPIs.",
    "email": "trevor@stagesenior.com",
    "phone": ""
  },
  "leigh-boney": {
    "bio": "Leigh Boney is the Executive Director of Golden Pond. She describes her role in senior care as deeply fulfilling, particularly through building connections with residents and their families. She has long wanted to run a retirement community and considers this her \"dream job\". She loves Golden Pond's strong sense of community, describing it as feeling like an \"extended family\" where staff contributions are celebrated. Her background in organizational management and communication allows her to bring a \"structured yet compassionate approach\" to the team. Outside of work, Leigh enjoys gardening, horseback riding, and spending time outdoors with her husband and dogs. These activities help her maintain balance and bring a sense of calm to her professional role. A particularly memorable moment for her was organizing a family day event where she witnessed residents' joy in connecting with loved ones, which reinforced her passion for senior care.",
    "email": "lboney@stagesenior.com",
    "phone": "303-271-0430"
  },
  "maria-torres": {
    "bio": "My name is Maria and I work at Golden Pond. I was born in Zacatecas, Mexico and raised in Denver, Colorado. My family moved here when I was 5yrs old. I have 2 sons. Growing up I was very close to my grandparents. I had great joy helping them in everything I could. In 2021 my last grandparent passed. I miss them dearly and working at a retirement community has helped me a lot. It brought me great joy, but also grief. I think that the hardest part of my job is meeting so many amazing people and not knowing if tomorrow I will get to see their faces once more. I've been a nanny, a server, a secretary for a construction company, a cashier, a hostess, a loan officers assistant and now a Life Enrichment Director which I absolutely love! I love making residents smile. I love helping them in every way I can. I've held Spanish classes which they enjoy very much. The connections and conversations I have with residents are always unique and fulfilling to say the least. It feels like taking care of my grandparents only this time I get paid for it. Every day is something new and exciting. I never thought I'd look forward to a job, which by the way does not feel like one to me. Outside of work I enjoy hiking, riding horses, making floral arrangements, spending time with my family, walks by the creek and skiing! I tried snowboarding but failed so stuck to skiing. I love nature. I love to cook more than eating out.",
    "email": "info@goldenpond.com",
    "phone": "303-271-0430"
  },
  "shellie-yushka": {
    "bio": "",
    "email": "info@goldenpond.com",
    "phone": "303-271-0430"
  },
  "chaz-osen": {
    "bio": "",
    "email": "chaz@gardensenliving.com",
    "phone": "303-973-5115"
  },
  "holly-jo-eames": {
    "bio": "",
    "email": "info@goldenpond.com",
    "phone": "303-271-0430"
  },
  "sarah-stevenson": {
    "bio": "",
    "email": "sarahs@goldenpond.com",
    "phone": "303-502-5554"
  },
  "bob-burden": {
    "bio": "Chef Bob brings decades of experience, culinary awards and talent to our communities. We will be seeing his influence in our menus, team training, resident experience, food presentation and an intentional infusion of our culinary program in all departments.",
    "email": "info@goldenpond.com",
    "phone": "303-502-5554"
  },
  "marci-gerke": {
    "bio": "Marci was initially brought to senior care by a friend who introduced her to the Gardens at Columbine. Despite expecting to work there briefly, she \"fell in love with the residents and with the community and our team.\" About 10 years ago, her passion for Memory Care was sparked through conversations with families about residents needing specialized care. She is passionate about compassionate, person-centered care, particularly for those with dementia. She believes in avoiding traditional approaches that try to \"reorient residents to reality,\" instead focusing on individual preferences and engagement. Outside work, she enjoys spending time with her 4 children and 3 grandsons, creating scrapbooks and cards, traveling, and focusing on her spiritual relationship.",
    "email": "mgerke@stagesenior.com",
    "phone": "303-456-1500"
  },
  "alyssa-trujillo": {
    "bio": "",
    "email": "Alyssa@gardensatcolumbine.com",
    "phone": "720-740-1249"
  },
  "marnie-mckissack": {
    "bio": "",
    "email": "marnie@gardensatcolumbine.com",
    "phone": "303-973-5115"
  },
  "helen-rossi": {
    "bio": "",
    "email": "Helen@gardensatcolumbine.com",
    "phone": "303-973-5115"
  },
  "allie-mitchem": {
    "bio": "The most fulfilling aspect of her role is building loving relationships with residents and their families, which enhances the quality of care each resident receives. She loves that her community is constantly innovating to improve residents' quality of life, whether through new patio decor, an indoor garden, or a sensory room. Growing up raised by her grandparents, Allie never initially imagined working with elderly individuals. After losing her grandparents, she felt compelled to continue helping others. She has now worked in elder care for 12 years and considers her current role at Gardens her dream career. Outside of work, Allie is passionate about being a mother and wife. She feels fortunate to care for individuals with rich life experiences and hopes to learn from their wisdom. Her family enjoys activities like fishing, exploring, and engaging with animals.",
    "email": "info@gardensatcolumbine.com",
    "phone": "303-973-5115"
  },
  "matt-turk": {
    "bio": "",
    "email": "",
    "phone": "720-740-1249"
  },
  "rich-thomas": {
    "bio": "",
    "email": "Rich@gardensatcolumbine.com",
    "phone": "303-973-5115"
  },
  "sydney-hertz": {
    "bio": "",
    "email": "Sydney@gardensatcolumbine.com",
    "phone": "303-973-5115"
  },
  "mariah-ruell": {
    "bio": "",
    "email": "mruell@stagesenior.com",
    "phone": "720-797-7164"
  }
}
