{
  "leigh-boney": {
    "bio": "**Why did you want to work in senior care?**\nI've wanted to run a retirement community for as long as I can remember. It's always been my dream job!\n\n**What makes you good at what you do?**\nI bring strong organizational skills and a commitment to clear communication. I focus on creating clear guidelines and improving processes to ensure everything runs smoothly.\n\n**What is the most fulfilling aspect of your role in senior care?**\nThe most fulfilling aspect of my role in senior care is the deep connection I build with residents and their families.\n\n**What do you love most about this community?**\nI love the strong sense of community and belonging at Golden Pond. It's a place where everyone truly cares for one another, and that sense of camaraderie makes it feel like an extended family.\n\n**Tell us about a memorable moment in your career.**\nOne memorable moment was organizing a family day event where I witnessed the residents' smiles and laughter with their loved ones, which reinforced my passion for senior care.\n\n**What are your hobbies or interests outside of work?**\nOutside of work, I enjoy gardening, horseback riding, and spending time outdoors with my husband and our dogs.",
    "email": null,
    "phone": "303-271-0430"
  },
  "maria-torres": {
    "bio": "**Where are you from?**\nI was born in Zacatecas, Mexico, and moved to Denver, Colorado when I was 5 years old.\n\n**Tell us about your family.**\nI have 2 sons and grew up very close to my grandparents.\n\n**What did you do before working in senior care?**\nI've had many roles including nanny, server, secretary for a construction company, cashier, hostess, and loan officer's assistant.\n\n**What is the most fulfilling aspect of your role in senior care?**\nI love making residents smile. I love helping them in every way I can.\n\n**How has this work impacted you personally?**\nI lost my last grandparent in 2021, and working in this retirement community has helped me process that grief. This job is deeply meaningful and personal to me.\n\n**What are your hobbies?**\nI enjoy hiking, horseback riding, making floral arrangements, spending time with family, walking by the creek, and skiing. I tried snowboarding but switched to skiing! I also love cooking.\n\n**What do you value in a workplace?**\nWorking in a healthy work environment makes a world of difference.\n\n**Quote:**\n\"Each event we curate at Golden Pond is an opportunity to spark joy, foster connections, and create memorable moments.\"",
    "email": null,
    "phone": "303-271-0430"
  },
  "bob-burden": {
    "bio": "Bob Burden brings decades of experience, culinary awards and talent to Golden Pond. As our Regional Executive Chef, Bob will influence menus, team training, resident experience, food presentation, and the culinary program across departments.",
    "email": null,
    "phone": null
  },
  "sydney-hertz": {
    "bio": "As Director of Life Enrichment at The Gardens at Columbine, Sydney focuses on enhancing quality of life and creating unforgettable experiences for residents.\n\n**Quote:**\n\"Our Life Enrichment Program's top priorities are enhancing the quality of life and crafting unforgettable experiences within each of our events.\"",
    "email": null,
    "phone": "720-740-1249"
  }
}
